ТСД_файловая/src/DataProcessors/Розница/Розница.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Розница</name>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>ИД_Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоPKG</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладСборки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Короба</name>
    <attributes>
      <name>ИД_Короб</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принят</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканирован</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладСборки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИД_Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Короб</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЕдиницы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВведено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРасхождения</name>
      <type>
        <types>CatalogRef.ПричиныВозврата</types>
      </type>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МРЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриемДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ТСД_файловая/src/DataProcessors/Розница/Forms/ФормаТоварыКороба/Module.bsl
&НаКлиенте
Перем ВыполняетсяЗакрытие;


	
   
   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИД_Короб = Параметры.ИД_Короб;   
	ИД_Документ = Параметры.ИД_Документ;
	МДокумент = Параметры.Документы.НайтиСтроки(Новый Структура("ИД_Документ",Параметры.ИД_Документ)); 
	НомерДокумент = МДокумент[0].Номер; 
	ДатаДокумента = МДокумент[0].Дата;
    ТипДокумента = Параметры.ТипДокумента;
	МКороба = Параметры.Короба.НайтиСтроки(Новый Структура("ИД_Короб",Параметры.ИД_Короб));
    PKG = МКороба[0].НомерУпаковки;
	
	МТоварыДокумента = Параметры.Товары.НайтиСтроки(Новый Структура("ИД_Короб",Параметры.ИД_Короб)); 
	Если МТоварыДокумента.Количество() = 0 Тогда
		Отказ = истина;
		Сообщить("Відскануйте PKG");
		Возврат;
	КонецЕсли;
	
	сч = 1;
	Для Каждого СтрокаМтоварыДокумента Из МТоварыДокумента Цикл 
		   СтрокаТоварыPKG =  ТоварыPKG.Добавить(); 
		   ЗаполнитьЗначенияСвойств(СтрокаТоварыPKG,СтрокаМтоварыДокумента);   
		   СтрокаТоварыPKG.НомерСтроки = сч;
		   ОбновитьЗаписьПоСтроке(,СтрокаТоварыPKG); 
		   сч = сч +1;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь; 

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ВыполняетсяЗакрытие Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити PKG?"+Символы.ПС+"Без збереження!",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры 

 &НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры  



&НаСервере
Процедура ОбновитьЗаписьПоСтроке(ИдентификаторСтроки = Неопределено,Знач Строка = Неопределено)
	
	Если НЕ ИдентификаторСтроки = Неопределено Тогда
		СтрокаТовара = ТоварыPKG.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		СтрокаТовара = Строка;
	КонецЕсли;
	
	//Если СтрокаТовара.МРЦ<>0  Тогда
	//	тНаименованиеТовара = СтрокаТовара.НаименованиеТовара  + " МРЦ - " + СтрокаТовара.МРЦ;
	//Иначе
	//	тНаименованиеТовара = СтрокаТовара.НаименованиеТовара;
	//КонецЕсли;
	Цвет = 0;
	Если СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоПоставщика Тогда
		 Цвет = 1;
	 ИначеЕсли СтрокаТовара.КоличествоВведено> 0 И СтрокаТовара.КоличествоВведено <> СтрокаТовара.КоличествоПоставщика Тогда
		  Цвет = 2;
	 КонецЕсли;
		 
	СтрокаТовара.Цвет = Цвет;	 
	//
	//ЧастьСтроки = Новый Массив;
	//Формат(СтрокаТовара.НомерСтроки,"ЧГ=") +", "+ СтрокаТовара.Артикул +", "+ СтрокаТовара.НаименованиеТовара+?(СтрокаТовара.МРЦ<>0," МРЦ-"+Формат(СтрокаТовара.МРЦ,"ЧГ="),"")+Символы.ПС
	
	ЗаписьПоСтроке = "%сдп% Прий. %КоличествоВведено% із %Количество%%НаименованиеЕдиницы% Х %Коэффициент% %МРЦ%";
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%КоличествоВведено%",    Формат(СтрокаТовара.КоличествоВведено, ?(СтрокаТовара.Весовой = 1,ЗначениеНастроекПовтИсп.ФорматВес(),ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло())));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Количество%",           Формат(СтрокаТовара.КоличествоПоставщика,?(СтрокаТовара.Весовой = 1,ЗначениеНастроекПовтИсп.ФорматВес(),ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло())));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%МРЦ%",   ?(СтрокаТовара.МРЦ<>0," МРЦ - " + СтрокаТовара.МРЦ,""));
	
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%сдп%",      ?(ЗначениеЗаполнено(СтрокаТовара.ПриемДо), "ддп "+Формат(СтрокаТовара.ПриемДо,"ДФ=dd.MM.yyyy"),""));
	СтрокаТовара.ЗаписьПоСтроке = ЗаписьПоСтроке;
		
КонецПроцедуры  


&НаСервере
Процедура ОбработатьСтроку(ИдентификаторСтроки,ДанныеТовара)

	
	ТекИдентификаторСтроки = ИдентификаторСтроки;
	
	СтрокаТовара = ТоварыPKG.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоВведено + ДанныеТовара.Количество;
	
	
	Если СтрокаТовара.КоличествоВведено > СтрокаТовара.КоличествоПоставщика Тогда
		Сообщить("Відскановано: "+Формат(СтрокаТовара.КоличествоВведено, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=")+Символы.ПС +"можна прийняти: "+Формат(СтрокаТовара.КоличествоПоставщика, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ="));
		
		СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоПоставщика;
		СтрокаТовара.КоличествоРасхождение =  СтрокаТовара.КоличествоПоставщика - СтрокаТовара.КоличествоВведено;
		
		
	Иначе
		СтрокаТовара.КоличествоРасхождение =  СтрокаТовара.КоличествоПоставщика - СтрокаТовара.КоличествоВведено;
		
	КонецЕсли;  
	ОбновитьЗаписьПоСтроке(,СтрокаТовара);
КонецПроцедуры



&НаКлиенте
Процедура ТоварыPKGВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыPKGПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыPKGПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТоварыВыбор(Элемент,,,);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыСтроки = ПолучитьПараметрыСтроки();
	ТекИдентификаторСтроки =  ПараметрыСтроки.ИдентификаторСтроки;
	
	Если НЕ ПараметрыСтроки = Неопределено Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ПараметрыСтроки.ИдентификаторСтроки);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеИзменитьСтроку", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.РедактированиеСтрокиV2", ПараметрыСтроки, ЭтаФорма,,,,ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыСтроки()
	
	ТекущиеДанные = Элементы.ТоварыPKG.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	СтруктураПараметров.Вставить("НомерСтроки",         ТекущиеДанные.НомерСтроки);
	СтруктураПараметров.Вставить("НаименованиеТовара",        ТекущиеДанные.НаименованиеТовара);
	СтруктураПараметров.Вставить("НаименованиеЕдиницы",          ТекущиеДанные.НаименованиеЕдиницы);
	СтруктураПараметров.Вставить("Коэффициент",                ТекущиеДанные.Коэффициент);
	СтруктураПараметров.Вставить("КоличествоПоставщика",                ТекущиеДанные.КоличествоПоставщика);
	СтруктураПараметров.Вставить("КоличествоВведено",                ТекущиеДанные.КоличествоВведено);
	СтруктураПараметров.Вставить("Коэффициент",                ТекущиеДанные.Коэффициент);
	СтруктураПараметров.Вставить("Весовой",                ТекущиеДанные.Весовой);
	СтруктураПараметров.Вставить("МРЦ",                ТекущиеДанные.МРЦ);
	СтруктураПараметров.Вставить("ТипДокумента",           ТипДокумента);   
	Если ТекущиеДанные.МРЦ = 0 Тогда
		СтруктураПараметров.Вставить("ИспМРЦ",Ложь);
	Иначе
		СтруктураПараметров.Вставить("ИспМРЦ",Истина);   
	КонецЕсли;
	

	Возврат СтруктураПараметров;

КонецФункции


&НаКлиенте
Процедура ОповещениеИзменитьСтроку(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;                   	
	ИдентификаторСтроки = ДополнительныеПараметры.ИдентификаторСтроки;
	СтрокаТаблицы = ТоварыPKG.НайтиПоИдентификатору(ИдентификаторСтроки);
	//
	Если Результат.Свойство("Сохранить") Тогда
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Результат,"КоличествоВведено,КоличествоРасхождение");
		
		ОбновитьЗаписьПоСтроке(ИдентификаторСтроки);
		
		Модифицированность = Истина;
		
		ПодсветитьСтроку(ИдентификаторСтроки);
	КонецЕсли;

	
КонецПроцедуры



&НаКлиенте
Процедура СтрокаПоискаТоварыПриИзменении(Элемент)
	ОбработатьВводСтрокиШК();
КонецПроцедуры




&НаКлиенте
Процедура ОбработатьВводСтрокиШК()
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;



	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
	ОбработатьПолученныйШтрихкод(СтрокаПоиска, ДополнительныеПараметры);
	
КонецПроцедуры

 
&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыТовара  = "ШтрихКод|Тара|ИспМРЦ";
	
	ДанныеПоТовару = ИнтеграцияТК_Клиент.ПолучитьДанныеПоТоваруКлиент(ПолученныйШтрихкод,,Ложь,ПараметрыТовара);
	
	ОбработатьПолученныеДанные(ДанныеПоТовару,Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныеДанные(ДанныеПоТовару, ДополнительныеПараметры) Экспорт
	
	Если ДанныеПоТовару.Результат = ложь Тогда
		Сообщить(?(ЗначениеЗаполнено(ДанныеПоТовару.ОписаниеОшибки), ДанныеПоТовару.ОписаниеОшибки,"Дані за штрих-кодом не отримані"));
		Возврат;
	КонецЕсли;
	
	ДанныеТовара = ДанныеПоТовару.Ответ;
		
	Если ДанныеТовара.Свойство("ИспМРЦ")  И Булево(ДанныеТовара.ИспМРЦ) Тогда
		
		
		///Костыль
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,"СтрокаПоиска","Вид",ВидПоляФормы.ПолеНадписи);
		
		ВыбратьМРЦ_Асинх(ДанныеТовара,ДополнительныеПараметры);
		
	Иначе
		ОбработатьПолученныеДанныеВыбор(ДанныеТовара, ДополнительныеПараметры) 
	КонецЕсли;
	//
Конецпроцедуры

 &НаКлиенте
Асинх Процедура ВыбратьМРЦ_Асинх(ДанныеТовара,ДополнительныеПараметры)
	Обещание =  ВвестиЧислоАсинх(0,"МРЦ",10,2);
	ВыбМРЦ = Ждать Обещание;  
	ОбработатьПолученныеДанныеВыбор(ДанныеТовара,ДополнительныеПараметры,ВыбМРЦ);
КонецПроцедуры  


 &НаКлиенте
Процедура ОбработатьПолученныеДанныеВыбор(ДанныеТовара, ДополнительныеПараметры,МРЦ=0) 
	
		
	
	ИД_Строка = ОпределитьСтроку(ДанныеТовара.Артикул,МРЦ);
	ТекИдентификаторСтроки = ИД_Строка;
	Если ИД_Строка = Неопределено Тогда
		
		ЗвукОшибки(Истина,"Товару немає в PKG!");
		Возврат;
	КонецЕсли;
	
	
	ОбработатьСтроку(ИД_Строка,ДанныеТовара);
	ПодсветитьСтроку(ИД_Строка);
	
	СтрокаПоиска ="";
КонецПроцедуры

 &НаСервере
Функция ОпределитьСтроку(Артикул,МРЦ=0)
	
			
	НайденныеСтроки = ТоварыPKG.НайтиСтроки(Новый Структура("Артикул,МРЦ", Артикул,МРЦ));

	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		СтрокаТЧ = НайденныеСтроки[0];
		
	КонецЕсли;
	
	Возврат СтрокаТЧ.ПолучитьИдентификатор();
	
КонецФункции


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
Процедура ЗвукОшибки(ВыполнитьОшибку = Ложь,ТекстОшибки ="")
	
	#Если МобильноеПриложениеКлиент Тогда
		
		СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение("errorscan",Истина);
		
	#КонецЕсли
	
	Если ВыполнитьОшибку Тогда
		
		 ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодсветитьСтроку(ИдентификаторСтроки)
	
	
	СтрокаТоваров = ТоварыPKG.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если НЕ СтрокаТоваров = Неопределено Тогда
		Элементы.ТоварыPKG.ТекущаяСтрока = ТекИдентификаторСтроки;
	
		НомерСтрокиДляПодсветки = СтрокаТоваров.НомерСтроки;
	
		ПодключитьОбработчикОжидания("Подключаемый_ТекущаяСтрока", 1,Истина);
		
		ИнтервалСек = 2;
		ПодключитьОбработчикОжидания("Подключаемый_ОчиститьНомерСтрокиДляПодсветки", ИнтервалСек,Истина);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ОчиститьНомерСтрокиДляПодсветки()
	
	НомерСтрокиДляПодсветки = Неопределено;
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ТекущаяСтрока()
	
	Элементы.ТоварыPKG.ТекущаяСтрока = ТекИдентификаторСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПриемPKG(Команда)
		
	ТоварыРасхождение.Очистить();
	
	Для Каждого пТовары Из ТоварыPKG Цикл
		расх = пТовары.КоличествоВведено - пТовары.КоличествоПоставщика;
		Если расх <> 0 Тогда
			
			нтРс = ТоварыРасхождение.Добавить();	 
			нтРс.Количество = расх;
			нтРс.СтрокаИД = пТовары.ПолучитьИдентификатор();
			нтРс.СтрокаТовара = пТовары.Артикул+?(пТовары.МРЦ>0," МРЦ-"+Формат(пТовары.МРЦ,"ЧЦ=10; ЧДЦ=2"),"")+ " "+пТовары.НаименованиеТовара;  
		КонецЕсли;
	КонецЦикла; 
	
	Если ТоварыРасхождение.Количество() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТаблицаРасхождений", ТоварыРасхождение);
		ДополнительныеПараметры.Вставить("ПарамВопрос", "ПриемPKG");	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеАктПоПриему", ЭтотОбъект);
		
		ОткрытьФорму("ОбщаяФорма.ФормаВопрос", ДополнительныеПараметры, ЭтаФорма,,,,ОписаниеОповещения);
	Иначе
		ВыполняетсяЗакрытие = Истина;	
		Закрыть(Новый Структура("ИД_Документ,ИД_Короб,ТоварыPKG",ИД_Документ,ИД_Короб,ТоварыPKG)); 
	КонецЕсли;
	
		

КонецПроцедуры

 &НаКлиенте
Процедура ОповещениеАктПоПриему(Результат, Параметры)Экспорт
	
	Если Результат.СоздатьАКТ Тогда
		
		Для Каждого СтрПричина Из Результат.ТабицаПричин Цикл 
			
			СтрокаТоваров = ТоварыPKG.НайтиПоИдентификатору(СтрПричина.СтрокаИД);
			СтрокаТоваров.ПричинаРасхождения = СтрПричина.Причина; 
			
		КонецЦикла;
		
		ВыполняетсяЗакрытие = Истина;	
		Закрыть(Новый Структура("ИД_Документ,ИД_Короб,ТоварыPKG",ИД_Документ,ИД_Короб,ТоварыPKG)); 	
		
	КонецЕсли;
	
КонецПроцедуры
